public class Factorial
{
    public static void main(String[] args)
    {
        // Заголовок
        System.out.printf("%-3s %-21s %-21s %-21s", "n", "factorial(n)", "factorialL(n)", "factorialD(n)");

        // Виведення факторіалів
        for(int i=1; i<=26; i++)
        {
            System.out.printf("\n%-3d %-21d %-21d %-21.3f", i, factorial(i), factorialL(i), factorialD(i));
        }
    }
    static int factorial(int n)
    {
        if (n == 1) return 1;
        return n*factorial(n - 1);
    }
    static long factorialL(int n)
    {
        if (n == 1) return 1L;
        return n*factorialL(n - 1);
    }
    static double factorialD(int n)
    {
        if (n == 1) return 1.0;
        return n*factorialD(n - 1);
    }
}
/*
n   factorial(n)          factorialL(n)         factorialD(n)
1   1                     1                     1,000
2   2                     2                     2,000
3   6                     6                     6,000
4   24                    24                    24,000
5   120                   120                   120,000
6   720                   720                   720,000
7   5040                  5040                  5040,000
8   40320                 40320                 40320,000
9   362880                362880                362880,000
10  3628800               3628800               3628800,000
11  39916800              39916800              39916800,000
12  479001600             479001600             479001600,000
13  1932053504            6227020800            6227020800,000
14  1278945280            87178291200           87178291200,000
15  2004310016            1307674368000         1307674368000,000
16  2004189184            20922789888000        20922789888000,000
17  -288522240            355687428096000       355687428096000,000
18  -898433024            6402373705728000      6402373705728000,000
19  109641728             121645100408832000    121645100408832000,000
20  -2102132736           2432902008176640000   2432902008176640000,000
21  -1195114496           -4249290049419214848  51090942171709440000,000
22  -522715136            -1250660718674968576  1124000727777607700000,000
23  862453760             8128291617894825984   25852016738884980000000,000
24  -775946240            -7835185981329244160  620448401733239400000000,000
25  2076180480            7034535277573963776   15511210043330986000000000,000
26  -1853882368           -1569523520172457984  403291461126605650000000000,000
int переповнюється після 12! (видасть неправильні значення з мінусами).

long переповнюється після 20!.

double покаже Infinity, починаючи приблизно з 171!, але 26! ще в нормі.
 */